jedarden/spaxel/firmware/sdkconfig.defaults
# SPAXEL Firmware Configuration Defaults
# Target: ESP32-S3

# Chip target
CONFIG_IDF_TARGET="esp32s3"

# Flash size — partitions.csv requires ~3.9MB (factory 1.9MB + ota_0 1.9MB + otadata)
# Using 4MB as minimum supported flash. Safe on 16MB boards: spi_flash only panics
# when physical < header, not when physical > header.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# WiFi CSI Configuration
CONFIG_ESP_WIFI_RX_BCN_ADAPT=y
CONFIG_ESP_WIFI_RX_BCN_ADAPT_THRESHOLD=10

# Enable CSI
CONFIG_ESP_WIFI_CSI_ENABLED=y

# WiFi power save disabled for stable CSI
CONFIG_PM_ENABLE=n

# FreeRTOS configuration for dual-core
CONFIG_FREERTOS_UNICORE=n

# BLE configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_RPA_SUPPORTED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# Increase main task stack for WiFi/BLE operations
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# esp_http_client options. This component serves the OTA firmware download
# (ota_task in main/websocket.c) — it is not the WebSocket control channel.
#
# HTTPS must stay ON: the mothership advertises SPAXEL_ADVERTISED_BASE_URL,
# and production sets it to https://spaxel.ardenone.com, so every OTA URL a
# node receives is https://. With =n the client cannot open a TLS connection
# and every update fails before the first byte lands in the OTA slot.
# Certificates validate against the compiled-in CA bundle
# (CONFIG_MBEDTLS_CERTIFICATE_BUNDLE, already linked for the wss:// control
# channel); for a plain-http bench URL the bundle is simply unused.
# See spaxel-bbe7f6fc / ADR-004.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# Log levels
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Watchdog configuration.
#
# Previously disabled, which meant a hung task left the node unreachable
# forever — and on real hardware the only recovery was a physical USB replug.
# For nodes mounted around a living space that is the difference between a
# transient glitch and a trip up a ladder, so the watchdog is now ON.
#
# The timeout is deliberately generous relative to the 60s OTA boot-validation
# window + 60s boot-good window: ESPHome shipped a regression (2026.4.0)
# where a too-aggressive task watchdog reset devices BEFORE that window closed
# and triggered spurious OTA rollbacks. Tune these two together, never
# independently. See bf-2tgcx.
#
# The window that matters is armed in code, not here: watchdog_init()
# (firmware/main/watchdog.c, called early in app_main, before wifi_init())
# reconfigures the running TWDT to SPAXEL_WATCHDOG_TIMEOUT_S — 90s, pinned in
# watchdog.h, which is the single place to tune it. ESP-IDF caps this Kconfig
# symbol at 60 ("range 1 60" in components/esp_system/Kconfig) and silently
# drops a larger value on every reconfigure rather than erroring: 150 was set
# here until 2026-09-05 and configured nothing. 60 is the ceiling, and it only
# covers startup (IDF init until watchdog_init() runs), where the idle tasks
# are the only subscribers.
#
# Corrected 2026-09-05 (with ADR-004): the two boot windows are sequential,
# not additive — the 60s boot-good timer starts only after OTA validation
# succeeds (confirm_ota_valid(), websocket.c), so the rollback-critical span
# is the 60s validation window (websocket.c SPAXEL_OTA_VALID_TIMEOUT_S), which
# the 90s runtime window covers with 30s of margin. This block used to claim
# the two windows summed to ">120s (150s here)"; that sum was compared against
# a value IDF was discarding, and the 90s runtime window is what actually
# ships.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_TASK_WDT_PANIC=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10

# NVS
CONFIG_NVS_ENCRYPTION=n

# OTA — dual-partition rollback support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ROLLBACK_COUNT=1
CONFIG_APP_ROLLBACK_ENABLE=y

# OTA — anti-rollback protection (prevents downgrade attacks)
# Uses eFuse-based security version counter. Once a higher version is written,
# the device permanently refuses to boot lower versions, even if an attacker
# can flash the firmware. This is defense-in-depth against mothership compromise.
CONFIG_APP_ANTI_ROLLBACK=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK_EFuse=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK_EFuse_WP_DISABLE=y

# Secure Boot V2 — signed app verification
# Verifies RSA-PSS signature of every firmware image before booting.
# An attacker who can serve the firmware URL or intercept HTTP still cannot
# execute arbitrary code because the bootloader will reject unsigned images.
# Requires firmware signing key (see scripts/generate-signing-key.sh).
CONFIG_SECURE_BOOT_V2=y
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
CONFIG_SECURE_BOOT_V2_PREFERRED=y
CONFIG_SECURE_BOOT_V2_RSA_MODE_2048=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y

# Allow secure boot to be disabled via eFuse for development boards.
# Production devices should burn this eFuse to permanently enable verification.
CONFIG_SECURE_BOOT_V2_ALLOW_EFUSE_DISABLE=y

# Increase partition sizes for OTA
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LED identification blink
CONFIG_SPAXEL_LED_GPIO=8

# PSRAM support — 2MB external PSRAM on ESP32-S3
# Critical for TLS handshake heap measurement (ADR-008 decision 5)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_CACHE_WRITETHROUGH=y
